app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Biology"], ["room_number", 42], ["created_at", "2021-03-03 21:25:04.640607"], ["updated_at", "2021-03-03 21:25:04.640607"]]
---
  def create
    @school_class = SchoolClass.create(school_params)