app/controllers/students_controller.rb

  def create
    student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Rocky"], ["last_name", "Balboa"], ["created_at", "2021-03-03 20:59:28.264532"], ["updated_at", "2021-03-03 20:59:28.264532"]]

  def update
    student = Student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Rocky1"], ["last_name", "Balboa"], ["updated_at", "2021-03-03 20:59:38.006241"], ["id", 1]]